[
  {
    "DOI": "10.1088/2058-9565/aa8072",
    "URL": "https://doi.org/10.1088/2058-9565/aa8072",
    "abstract": "Classical autoencoders are neural networks that can learn efficient low-dimensional representations of data in higher-dimensional space. The task of an autoencoder is, given an input x, to map x to a lower dimensional point y such that x can likely be recovered from y. The structure of the underlying autoencoder network can be chosen to represent the data on a smaller dimension, effectively compressing the input. Inspired by this idea, we introduce the model of a quantum autoencoder to perform similar tasks on quantum data. The quantum autoencoder is trained to compress a particular data set of quantum states, where a classical compression algorithm cannot be employed. The parameters of the quantum autoencoder are trained using classical optimization algorithms. We show an example of a simple programmable circuit that can be trained as an efficient autoencoder. We apply our model in the context of quantum simulation to compress ground states of the Hubbard model and molecular Hamiltonians.",
    "author": [
      {
        "family": "Romero",
        "given": "Jonathan"
      },
      {
        "family": "Olson",
        "given": "Jonathan P"
      },
      {
        "family": "Aspuru-Guzik",
        "given": "Alan"
      }
    ],
    "container-title": "Quantum Science and Technology",
    "id": "Romero_2017",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2017,
          8
        ]
      ]
    },
    "page": "045001",
    "publisher": "IOP Publishing",
    "title": "Quantum autoencoders for efficient compression of quantum data",
    "type": "article-journal",
    "volume": "2"
  },
  {
    "DOI": "10.1088/1361-6633/ac36b9",
    "URL": "http://arxiv.org/abs/2101.08320",
    "abstract": "A new paradigm for data-driven, model-agnostic new physics searches at colliders is emerging, and aims to leverage recent breakthroughs in anomaly detection and machine learning. In order to develop and benchmark new anomaly detection methods within this framework, it is essential to have standard datasets. To this end, we have created the LHC Olympics 2020, a community challenge accompanied by a set of simulated collider events. Participants in these Olympics have developed their methods using an R&D dataset and then tested them on black boxes: datasets with an unknown anomaly (or not). This paper will review the LHC Olympics 2020 challenge, including an overview of the competition, a description of methods deployed in the competition, lessons learned from the experience, and implications for data analyses with future datasets as well as future colliders.",
    "author": [
      {
        "family": "Kasieczka",
        "given": "Gregor"
      },
      {
        "family": "Nachman",
        "given": "Benjamin"
      },
      {
        "family": "Shih",
        "given": "David"
      },
      {
        "family": "Amram",
        "given": "Oz"
      },
      {
        "family": "Andreassen",
        "given": "Anders"
      },
      {
        "family": "Benkendorfer",
        "given": "Kees"
      },
      {
        "family": "Bortolato",
        "given": "Blaz"
      },
      {
        "family": "Brooijmans",
        "given": "Gustaaf"
      },
      {
        "family": "Canelli",
        "given": "Florencia"
      },
      {
        "family": "Collins",
        "given": "Jack H."
      },
      {
        "family": "Dai",
        "given": "Biwei"
      },
      {
        "family": "Freitas",
        "given": "Felipe F. De"
      },
      {
        "family": "Dillon",
        "given": "Barry M."
      },
      {
        "family": "Dinu",
        "given": "Ioan-Mihail"
      },
      {
        "family": "Dong",
        "given": "Zhongtian"
      },
      {
        "family": "Donini",
        "given": "Julien"
      },
      {
        "family": "Duarte",
        "given": "Javier"
      },
      {
        "family": "Faroughy",
        "given": "D. A."
      },
      {
        "family": "Gonski",
        "given": "Julia"
      },
      {
        "family": "Harris",
        "given": "Philip"
      },
      {
        "family": "Kahn",
        "given": "Alan"
      },
      {
        "family": "Kamenik",
        "given": "Jernej F."
      },
      {
        "family": "Khosa",
        "given": "Charanjit K."
      },
      {
        "family": "Komiske",
        "given": "Patrick"
      },
      {
        "family": "Pottier",
        "given": "Luc Le"
      },
      {
        "family": "Martín-Ramiro",
        "given": "Pablo"
      },
      {
        "family": "Matevc",
        "given": "Andrej"
      },
      {
        "family": "Metodiev",
        "given": "Eric"
      },
      {
        "family": "Mikuni",
        "given": "Vinicius"
      },
      {
        "family": "Ochoa",
        "given": "Inês"
      },
      {
        "family": "Park",
        "given": "Sang Eon"
      },
      {
        "family": "Pierini",
        "given": "Maurizio"
      },
      {
        "family": "Rankin",
        "given": "Dylan"
      },
      {
        "family": "Sanz",
        "given": "Veronica"
      },
      {
        "family": "Sarda",
        "given": "Nilai"
      },
      {
        "family": "Seljak",
        "given": "Urous"
      },
      {
        "family": "Smolkovic",
        "given": "Aleks"
      },
      {
        "family": "Stein",
        "given": "George"
      },
      {
        "family": "Suarez",
        "given": "Cristina Mantilla"
      },
      {
        "family": "Szewc",
        "given": "Manuel"
      },
      {
        "family": "Thaler",
        "given": "Jesse"
      },
      {
        "family": "Tsan",
        "given": "Steven"
      },
      {
        "family": "Udrescu",
        "given": "Silviu-Marian"
      },
      {
        "family": "Vaslin",
        "given": "Louis"
      },
      {
        "family": "Vlimant",
        "given": "Jean-Roch"
      },
      {
        "family": "Williams",
        "given": "Daniel"
      },
      {
        "family": "Yunus",
        "given": "Mikaeel"
      }
    ],
    "id": "Kasieczka2021",
    "issued": {
      "date-parts": [
        [
          2021,
          1
        ]
      ]
    },
    "keyword": "hep-ph, hep-ex, physics.data-an",
    "title": "The LHC Olympics 2020: A Community Challenge for Anomaly Detection in High Energy Physics",
    "type": "article-journal"
  },
  {
    "DOI": "10.22331/q-2018-08-06-79",
    "URL": "http://arxiv.org/abs/1801.00862",
    "abstract": "Noisy Intermediate-Scale Quantum (NISQ) technology will be available in the near future. Quantum computers with 50-100 qubits may be able to perform tasks which surpass the capabilities of today’s classical digital computers, but noise in quantum gates will limit the size of quantum circuits that can be executed reliably. NISQ devices will be useful tools for exploring many-body quantum physics, and may have other useful applications, but the 100-qubit quantum computer will not change the world right away — we should regard it as a significant step toward the more powerful quantum technologies of the future. Quantum technologists should continue to strive for more accurate quantum gates and, eventually, fully fault-tolerant quantum computing.",
    "author": [
      {
        "family": "Preskill",
        "given": "John"
      }
    ],
    "container-title": "Quantum 2, 79 (2018)",
    "id": "Preskill2018",
    "issued": {
      "date-parts": [
        [
          2018,
          1
        ]
      ]
    },
    "keyword": "quant-ph, cond-mat.str-el",
    "title": "Quantum Computing in the NISQ era and beyond",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevD.105.095004",
    "URL": "http://arxiv.org/abs/2112.04958",
    "abstract": "The lack of evidence for new interactions and particles at the Large Hadron Collider has motivated the high-energy physics community to explore model-agnostic data-analysis approaches to search for new physics. Autoencoders are unsupervised machine learning models based on artificial neural networks, capable of learning background distributions. We study quantum autoencoders based on variational quantum circuits for the problem of anomaly detection at the LHC. For a QCD $t\\bar{t}$ background and resonant heavy Higgs signals, we find that a simple quantum autoencoder outperforms classical autoencoders for the same inputs and trains very efficiently. Moreover, this performance is reproducible on present quantum devices. This shows that quantum autoencoders are good candidates for analysing high-energy physics data in future LHC runs.",
    "author": [
      {
        "family": "Ngairangbam",
        "given": "Vishal S."
      },
      {
        "family": "Spannowsky",
        "given": "Michael"
      },
      {
        "family": "Takeuchi",
        "given": "Michihisa"
      }
    ],
    "container-title": "Phys. Rev. D 105, 095004, 2022",
    "id": "Ngairangbam2021",
    "issued": {
      "date-parts": [
        [
          2021,
          12
        ]
      ]
    },
    "keyword": "hep-ph, quant-ph",
    "title": "Anomaly detection in high-energy physics using a quantum autoencoder",
    "type": "article-journal"
  },
  {
    "DOI": "10.1088/2058-9565/aa8072",
    "URL": "http://arxiv.org/abs/1612.02806",
    "abstract": "Classical autoencoders are neural networks that can learn efficient low dimensional representations of data in higher dimensional space. The task of an autoencoder is, given an input $x$, is to map $x$ to a lower dimensional point $y$ such that $x$ can likely be recovered from $y$. The structure of the underlying autoencoder network can be chosen to represent the data on a smaller dimension, effectively compressing the input. Inspired by this idea, we introduce the model of a quantum autoencoder to perform similar tasks on quantum data. The quantum autoencoder is trained to compress a particular dataset of quantum states, where a classical compression algorithm cannot be employed. The parameters of the quantum autoencoder are trained using classical optimization algorithms. We show an example of a simple programmable circuit that can be trained as an efficient autoencoder. We apply our model in the context of quantum simulation to compress ground states of the Hubbard model and molecular Hamiltonians.",
    "author": [
      {
        "family": "Romero",
        "given": "Jonathan"
      },
      {
        "family": "Olson",
        "given": "Jonathan P."
      },
      {
        "family": "Aspuru-Guzik",
        "given": "Alan"
      }
    ],
    "container-title": "Now published in 2017 Quantum Sci. Technol. 2 045001",
    "id": "Romero2016",
    "issued": {
      "date-parts": [
        [
          2016,
          12
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Quantum autoencoders for efficient compression of quantum data",
    "type": "article-journal"
  },
  {
    "DOI": "10.1109/ICSA-C52384.2021.00025",
    "author": [
      {
        "family": "Weigold",
        "given": "Manuela"
      },
      {
        "family": "Barzen",
        "given": "Johanna"
      },
      {
        "family": "Leymann",
        "given": "Frank"
      },
      {
        "family": "Salm",
        "given": "Marie"
      }
    ],
    "container-title": "2021 IEEE 18th International Conference on Software Architecture Companion (ICSA-C)",
    "id": "encodings",
    "issued": {
      "date-parts": [
        [
          2021
        ]
      ]
    },
    "page": "95-101",
    "title": "Expanding Data Encoding Patterns For Quantum Algorithms",
    "type": "paper-conference"
  },
  {
    "DOI": "10.22331/q-2020-02-06-226",
    "URL": "http://arxiv.org/abs/1907.02085",
    "abstract": "A single qubit provides sufficient computational capabilities to construct a universal quantum classifier when assisted with a classical subroutine. This fact may be surprising since a single qubit only offers a simple superposition of two states and single-qubit gates only make a rotation in the Bloch sphere. The key ingredient to circumvent these limitations is to allow for multiple data re-uploading. A quantum circuit can then be organized as a series of data re-uploading and single-qubit processing units. Furthermore, both data re-uploading and measurements can accommodate multiple dimensions in the input and several categories in the output, to conform to a universal quantum classifier. The extension of this idea to several qubits enhances the efficiency of the strategy as entanglement expands the superpositions carried along with the classification. Extensive benchmarking on different examples of the single- and multi-qubit quantum classifier validates its ability to describe and classify complex data.",
    "author": [
      {
        "family": "Pérez-Salinas",
        "given": "Adrián"
      },
      {
        "family": "Cervera-Lierta",
        "given": "Alba"
      },
      {
        "family": "Gil-Fuster",
        "given": "Elies"
      },
      {
        "family": "Latorre",
        "given": "José I."
      }
    ],
    "container-title": "Quantum 4, 226 (2020)",
    "id": "PerezSalinas2019",
    "issued": {
      "date-parts": [
        [
          2019,
          7
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Data re-uploading for a universal quantum classifier",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1412.1193",
    "abstract": "Natural gradient descent is an optimization method traditionally motivated from the perspective of information geometry, and works well for many applications as an alternative to stochastic gradient descent. In this paper we critically analyze this method and its properties, and show how it can be viewed as a type of 2nd-order optimization method, with the Fisher information matrix acting as a substitute for the Hessian. In many important cases, the Fisher information matrix is shown to be equivalent to the Generalized Gauss-Newton matrix, which both approximates the Hessian, but also has certain properties that favor its use over the Hessian. This perspective turns out to have significant implications for the design of a practical and robust natural gradient optimizer, as it motivates the use of techniques like trust regions and Tikhonov regularization. Additionally, we make a series of contributions to the understanding of natural gradient and 2nd-order methods, including: a thorough analysis of the convergence speed of stochastic natural gradient descent (and more general stochastic 2nd-order methods) as applied to convex quadratics, a critical examination of the oft-used \"empirical\" approximation of the Fisher matrix, and an analysis of the (approximate) parameterization invariance property possessed by natural gradient methods (which we show also holds for certain other curvature, but notably not the Hessian).",
    "author": [
      {
        "family": "Martens",
        "given": "James"
      }
    ],
    "id": "Martens2014",
    "issued": {
      "date-parts": [
        [
          2014,
          12
        ]
      ]
    },
    "keyword": "cs.LG, stat.ML",
    "title": "New insights and perspectives on the natural gradient method",
    "type": "article-journal"
  },
  {
    "DOI": "10.22331/q-2020-05-25-269",
    "URL": "http://arxiv.org/abs/1909.02108",
    "abstract": "A quantum generalization of Natural Gradient Descent is presented as part of a general-purpose optimization framework for variational quantum circuits. The optimization dynamics is interpreted as moving in the steepest descent direction with respect to the Quantum Information Geometry, corresponding to the real part of the Quantum Geometric Tensor (QGT), also known as the Fubini-Study metric tensor. An efficient algorithm is presented for computing a block-diagonal approximation to the Fubini-Study metric tensor for parametrized quantum circuits, which may be of independent interest.",
    "author": [
      {
        "family": "Stokes",
        "given": "James"
      },
      {
        "family": "Izaac",
        "given": "Josh"
      },
      {
        "family": "Killoran",
        "given": "Nathan"
      },
      {
        "family": "Carleo",
        "given": "Giuseppe"
      }
    ],
    "container-title": "Quantum 4, 269 (2020)",
    "id": "Stokes2019",
    "issued": {
      "date-parts": [
        [
          2019,
          9
        ]
      ]
    },
    "keyword": "quant-ph, cs.LG, stat.ML",
    "title": "Quantum Natural Gradient",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevLett.126.140502",
    "URL": "http://arxiv.org/abs/1901.05374",
    "abstract": "A broad class of hybrid quantum-classical algorithms known as \"variational algorithms\" have been proposed in the context of quantum simulation, machine learning, and combinatorial optimization as a means of potentially achieving a quantum speedup on a near-term quantum device for a problem of practical interest. Such algorithms use the quantum device only to prepare parameterized quantum states and make simple measurements. A classical controller uses the measurement results to perform an optimization of a classical function induced by a quantum observable which defines the problem. While most prior works have considered optimization strategies based on estimating the objective function and doing a derivative-free or finite-difference-based optimization, some recent proposals involve directly measuring observables corresponding to the gradient of the objective function. The measurement procedure needed requires coherence time barely longer than that needed to prepare a trial state. We prove that strategies based on such gradient measurements can admit substantially faster rates of convergence to the optimum in some contexts. We first introduce a natural black-box setting for variational algorithms which we prove our results with respect to. We define a simple class of problems for which a variational algorithm based on low-depth gradient measurements and stochastic gradient descent converges to the optimum substantially faster than any possible strategy based on estimating the objective function itself, and show that stochastic gradient descent is essentially optimal for this problem. Importing known results from the stochastic optimization literature, we also derive rigorous upper bounds on the cost of variational optimization in a convex region when using gradient measurements in conjunction with certain stochastic gradient descent or stochastic mirror descent algorithms.",
    "author": [
      {
        "family": "Harrow",
        "given": "Aram"
      },
      {
        "family": "Napp",
        "given": "John"
      }
    ],
    "container-title": "Phys. Rev. Lett. 126, 140502 (2021)",
    "id": "Harrow2019",
    "issued": {
      "date-parts": [
        [
          2019,
          1
        ]
      ]
    },
    "keyword": "quant-ph, math.OC",
    "title": "Low-depth gradient measurements can improve convergence in variational hybrid quantum-classical algorithms",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1909.05074",
    "abstract": "The variational quantum eigensolver is a hybrid algorithm composed of quantum state driving and classical parameter optimization, for finding the ground state of a given Hamiltonian. The natural gradient method is an optimization method taking into account the geometric structure of the parameter space. Very recently, Stokes et al. developed the general method for employing the natural gradient for the variational quantum eigensolver. This paper gives some simple case-studies of this optimization method, to see in detail how the natural gradient optimizer makes use of the geometric property to change and improve the ordinary gradient method.",
    "author": [
      {
        "family": "Yamamoto",
        "given": "Naoki"
      }
    ],
    "id": "Yamamoto2019",
    "issued": {
      "date-parts": [
        [
          2019,
          9
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "On the natural gradient for variational quantum eigensolver",
    "type": "article-journal"
  },
  {
    "DOI": "10.1162/089976698300017746",
    "author": [
      {
        "family": "Amari",
        "given": "Shun-ichi"
      }
    ],
    "container-title": "Neural Computation",
    "id": "Amari1998",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1998,
          2
        ]
      ]
    },
    "page": "251-276",
    "publisher": "MIT Press - Journals",
    "title": "Natural Gradient Works Efficiently in Learning",
    "type": "article-journal",
    "volume": "10"
  },
  {
    "DOI": "10.1007/JHEP08(2017)105",
    "URL": "http://arxiv.org/abs/1705.05891",
    "abstract": "We consider rare semileptonic decays of a heavy $D$-meson into a light vector meson in the framework of QCD factorization. In contrast to the corresponding $B$-meson decays, the naive factorization hypothesis does not even serve as a first approximation. Rather, the decay amplitudes appear to be dominated by non-factorizable dynamics, e.g. through annihilation topologies, which are particularly sensitive to long-distance hadronic contributions. We therefore pay particular attention to intermediate vector-meson resonances appearing in quark-loop and annihilation topologies. Compared to the analogous $B$-meson decays, we identify a number of effects that result in very large theoretical uncertainties for differential decay rates. Some of these effects are found to cancel in the ratio of partially integrated decay rates for transversely and longitudinally polarized $\\rho$ mesons. On the phenomenological side this implies a very limited potential to constrain physics beyond the Standard Model by means of these decays.",
    "author": [
      {
        "family": "Feldmann",
        "given": "Thorsten"
      },
      {
        "family": "Mueller",
        "given": "Bastian"
      },
      {
        "family": "Seidel",
        "given": "Dirk"
      }
    ],
    "id": "Feldmann2017",
    "issued": {
      "date-parts": [
        [
          2017,
          5
        ]
      ]
    },
    "keyword": "hep-ph, hep-ex",
    "title": "$D \\to ρ\\,\\ell^+\\ell^-$ Decays in the QCD Factorization Approach",
    "type": "article-journal"
  },
  {
    "DOI": "10.1007/BF02551274",
    "ISSN": "1435-568X",
    "URL": "https://doi.org/10.1007/BF02551274",
    "abstract": "In this paper we demonstrate that finite linear combinations of compositions of a fixed, univariate function and a set of affine functionals can uniformly approximate any continuous function ofn real variables with support in the unit hypercube; only mild conditions are imposed on the univariate function. Our results settle an open question about representability in the class of single hidden layer neural networks. In particular, we show that arbitrary decision regions can be arbitrarily well approximated by continuous feedforward neural networks with only a single internal, hidden layer and any continuous sigmoidal nonlinearity. The paper discusses approximation properties of other possible types of nonlinearities that might be implemented by artificial neural networks.",
    "author": [
      {
        "family": "Cybenko",
        "given": "G."
      }
    ],
    "container-title": "Mathematics of Control, Signals and Systems",
    "id": "Cybenko1989",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          1989,
          12,
          1
        ]
      ]
    },
    "page": "303-314",
    "title": "Approximation by superpositions of a sigmoidal function",
    "type": "article-journal",
    "volume": "2"
  },
  {
    "DOI": "https://doi.org/10.1016/0893-6080(91)90009-T",
    "ISSN": "0893-6080",
    "URL": "https://www.sciencedirect.com/science/article/pii/089360809190009T",
    "abstract": "We show that standard multilayer feedforward networks with as few as a single hidden layer and arbitrary bounded and nonconstant activation function are universal approximators with respect to Lp(μ) performance criteria, for arbitrary finite input environment measures μ, provided only that sufficiently many hidden units are available. If the activation function is continuous, bounded and nonconstant, then continuous mappings can be learned uniformly over compact input sets. We also give very general conditions ensuring that networks with sufficiently smooth activation functions are capable of arbitrarily accurate approximation to a function and its derivatives.",
    "author": [
      {
        "family": "Hornik",
        "given": "Kurt"
      }
    ],
    "container-title": "Neural Networks",
    "id": "Hornik1991",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1991
        ]
      ]
    },
    "keyword": "Multilayer feedforward networks, Activation function, Universal approximation capabilities, Input environment measure, () approximation, Uniform approximation, Sobolev spaces, Smooth approximation",
    "page": "251-257",
    "title": "Approximation capabilities of multilayer feedforward networks",
    "type": "article-journal",
    "volume": "4"
  },
  {
    "DOI": "10.1109/ACCESS.2021.3075492",
    "author": [
      {
        "family": "Easom-Mccaldin",
        "given": "Philip"
      },
      {
        "family": "Bouridane",
        "given": "Ahmed"
      },
      {
        "family": "Belatreche",
        "given": "Ammar"
      },
      {
        "family": "Jiang",
        "given": "Richard"
      }
    ],
    "container-title": "IEEE Access",
    "id": "9415627",
    "issued": {
      "date-parts": [
        [
          2021
        ]
      ]
    },
    "page": "65127-65139",
    "title": "On Depth, Robustness and Performance Using the Data Re-Uploading Single-Qubit Classifier",
    "type": "article-journal",
    "volume": "9"
  }
]
