[
  {
    "DOI": "10.1088/2058-9565/aa8072",
    "URL": "https://doi.org/10.1088/2058-9565/aa8072",
    "abstract": "Classical autoencoders are neural networks that can learn efficient low-dimensional representations of data in higher-dimensional space. The task of an autoencoder is, given an input x, to map x to a lower dimensional point y such that x can likely be recovered from y. The structure of the underlying autoencoder network can be chosen to represent the data on a smaller dimension, effectively compressing the input. Inspired by this idea, we introduce the model of a quantum autoencoder to perform similar tasks on quantum data. The quantum autoencoder is trained to compress a particular data set of quantum states, where a classical compression algorithm cannot be employed. The parameters of the quantum autoencoder are trained using classical optimization algorithms. We show an example of a simple programmable circuit that can be trained as an efficient autoencoder. We apply our model in the context of quantum simulation to compress ground states of the Hubbard model and molecular Hamiltonians.",
    "author": [
      {
        "family": "Romero",
        "given": "Jonathan"
      },
      {
        "family": "Olson",
        "given": "Jonathan P"
      },
      {
        "family": "Aspuru-Guzik",
        "given": "Alan"
      }
    ],
    "container-title": "Quantum Science and Technology",
    "id": "Romero_2017",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2017,
          8
        ]
      ]
    },
    "page": "045001",
    "publisher": "IOP Publishing",
    "title": "Quantum autoencoders for efficient compression of quantum data",
    "type": "article-journal",
    "volume": "2"
  },
  {
    "DOI": "10.1088/1361-6633/ac36b9",
    "URL": "http://arxiv.org/abs/2101.08320",
    "abstract": "A new paradigm for data-driven, model-agnostic new physics searches at colliders is emerging, and aims to leverage recent breakthroughs in anomaly detection and machine learning. In order to develop and benchmark new anomaly detection methods within this framework, it is essential to have standard datasets. To this end, we have created the LHC Olympics 2020, a community challenge accompanied by a set of simulated collider events. Participants in these Olympics have developed their methods using an R&D dataset and then tested them on black boxes: datasets with an unknown anomaly (or not). This paper will review the LHC Olympics 2020 challenge, including an overview of the competition, a description of methods deployed in the competition, lessons learned from the experience, and implications for data analyses with future datasets as well as future colliders.",
    "author": [
      {
        "family": "Kasieczka",
        "given": "Gregor"
      },
      {
        "family": "Nachman",
        "given": "Benjamin"
      },
      {
        "dropping-particle": "et",
        "family": "al."
      }
    ],
    "id": "Kasieczka2021",
    "issued": {
      "date-parts": [
        [
          2021,
          1
        ]
      ]
    },
    "keyword": "hep-ph, hep-ex, physics.data-an",
    "title": "The LHC Olympics 2020: A Community Challenge for Anomaly Detection in High Energy Physics",
    "type": "article-journal"
  },
  {
    "DOI": "10.22331/q-2018-08-06-79",
    "URL": "http://arxiv.org/abs/1801.00862",
    "abstract": "Noisy Intermediate-Scale Quantum (NISQ) technology will be available in the near future. Quantum computers with 50-100 qubits may be able to perform tasks which surpass the capabilities of today’s classical digital computers, but noise in quantum gates will limit the size of quantum circuits that can be executed reliably. NISQ devices will be useful tools for exploring many-body quantum physics, and may have other useful applications, but the 100-qubit quantum computer will not change the world right away — we should regard it as a significant step toward the more powerful quantum technologies of the future. Quantum technologists should continue to strive for more accurate quantum gates and, eventually, fully fault-tolerant quantum computing.",
    "author": [
      {
        "family": "Preskill",
        "given": "John"
      }
    ],
    "container-title": "Quantum 2, 79 (2018)",
    "id": "Preskill2018",
    "issued": {
      "date-parts": [
        [
          2018,
          1
        ]
      ]
    },
    "keyword": "quant-ph, cond-mat.str-el",
    "title": "Quantum Computing in the NISQ era and beyond",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevD.105.095004",
    "URL": "http://arxiv.org/abs/2112.04958",
    "abstract": "The lack of evidence for new interactions and particles at the Large Hadron Collider has motivated the high-energy physics community to explore model-agnostic data-analysis approaches to search for new physics. Autoencoders are unsupervised machine learning models based on artificial neural networks, capable of learning background distributions. We study quantum autoencoders based on variational quantum circuits for the problem of anomaly detection at the LHC. For a QCD $t\\bar{t}$ background and resonant heavy Higgs signals, we find that a simple quantum autoencoder outperforms classical autoencoders for the same inputs and trains very efficiently. Moreover, this performance is reproducible on present quantum devices. This shows that quantum autoencoders are good candidates for analysing high-energy physics data in future LHC runs.",
    "author": [
      {
        "family": "Ngairangbam",
        "given": "Vishal S."
      },
      {
        "family": "Spannowsky",
        "given": "Michael"
      },
      {
        "family": "Takeuchi",
        "given": "Michihisa"
      }
    ],
    "container-title": "Phys. Rev. D 105, 095004, 2022",
    "id": "Ngairangbam2021",
    "issued": {
      "date-parts": [
        [
          2021,
          12
        ]
      ]
    },
    "keyword": "hep-ph, quant-ph",
    "title": "Anomaly detection in high-energy physics using a quantum autoencoder",
    "type": "article-journal"
  },
  {
    "DOI": "10.1088/2058-9565/aa8072",
    "URL": "http://arxiv.org/abs/1612.02806",
    "abstract": "Classical autoencoders are neural networks that can learn efficient low dimensional representations of data in higher dimensional space. The task of an autoencoder is, given an input $x$, is to map $x$ to a lower dimensional point $y$ such that $x$ can likely be recovered from $y$. The structure of the underlying autoencoder network can be chosen to represent the data on a smaller dimension, effectively compressing the input. Inspired by this idea, we introduce the model of a quantum autoencoder to perform similar tasks on quantum data. The quantum autoencoder is trained to compress a particular dataset of quantum states, where a classical compression algorithm cannot be employed. The parameters of the quantum autoencoder are trained using classical optimization algorithms. We show an example of a simple programmable circuit that can be trained as an efficient autoencoder. We apply our model in the context of quantum simulation to compress ground states of the Hubbard model and molecular Hamiltonians.",
    "author": [
      {
        "family": "Romero",
        "given": "Jonathan"
      },
      {
        "family": "Olson",
        "given": "Jonathan P."
      },
      {
        "family": "Aspuru-Guzik",
        "given": "Alan"
      }
    ],
    "container-title": "Now published in 2017 Quantum Sci. Technol. 2 045001",
    "id": "Romero2016",
    "issued": {
      "date-parts": [
        [
          2016,
          12
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Quantum autoencoders for efficient compression of quantum data",
    "type": "article-journal"
  },
  {
    "DOI": "10.1109/ICSA-C52384.2021.00025",
    "author": [
      {
        "family": "Weigold",
        "given": "Manuela"
      },
      {
        "family": "Barzen",
        "given": "Johanna"
      },
      {
        "family": "Leymann",
        "given": "Frank"
      },
      {
        "family": "Salm",
        "given": "Marie"
      }
    ],
    "container-title": "2021 IEEE 18th International Conference on Software Architecture Companion (ICSA-C)",
    "id": "encodings",
    "issued": {
      "date-parts": [
        [
          2021
        ]
      ]
    },
    "page": "95-101",
    "title": "Expanding Data Encoding Patterns For Quantum Algorithms",
    "type": "paper-conference"
  },
  {
    "DOI": "10.22331/q-2020-02-06-226",
    "URL": "http://arxiv.org/abs/1907.02085",
    "abstract": "A single qubit provides sufficient computational capabilities to construct a universal quantum classifier when assisted with a classical subroutine. This fact may be surprising since a single qubit only offers a simple superposition of two states and single-qubit gates only make a rotation in the Bloch sphere. The key ingredient to circumvent these limitations is to allow for multiple data re-uploading. A quantum circuit can then be organized as a series of data re-uploading and single-qubit processing units. Furthermore, both data re-uploading and measurements can accommodate multiple dimensions in the input and several categories in the output, to conform to a universal quantum classifier. The extension of this idea to several qubits enhances the efficiency of the strategy as entanglement expands the superpositions carried along with the classification. Extensive benchmarking on different examples of the single- and multi-qubit quantum classifier validates its ability to describe and classify complex data.",
    "author": [
      {
        "family": "Pérez-Salinas",
        "given": "Adrián"
      },
      {
        "family": "Cervera-Lierta",
        "given": "Alba"
      },
      {
        "family": "Gil-Fuster",
        "given": "Elies"
      },
      {
        "family": "Latorre",
        "given": "José I."
      }
    ],
    "container-title": "Quantum 4, 226 (2020)",
    "id": "PerezSalinas2019",
    "issued": {
      "date-parts": [
        [
          2019,
          7
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Data re-uploading for a universal quantum classifier",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1412.1193",
    "abstract": "Natural gradient descent is an optimization method traditionally motivated from the perspective of information geometry, and works well for many applications as an alternative to stochastic gradient descent. In this paper we critically analyze this method and its properties, and show how it can be viewed as a type of 2nd-order optimization method, with the Fisher information matrix acting as a substitute for the Hessian. In many important cases, the Fisher information matrix is shown to be equivalent to the Generalized Gauss-Newton matrix, which both approximates the Hessian, but also has certain properties that favor its use over the Hessian. This perspective turns out to have significant implications for the design of a practical and robust natural gradient optimizer, as it motivates the use of techniques like trust regions and Tikhonov regularization. Additionally, we make a series of contributions to the understanding of natural gradient and 2nd-order methods, including: a thorough analysis of the convergence speed of stochastic natural gradient descent (and more general stochastic 2nd-order methods) as applied to convex quadratics, a critical examination of the oft-used \"empirical\" approximation of the Fisher matrix, and an analysis of the (approximate) parameterization invariance property possessed by natural gradient methods (which we show also holds for certain other curvature, but notably not the Hessian).",
    "author": [
      {
        "family": "Martens",
        "given": "James"
      }
    ],
    "id": "Martens2014",
    "issued": {
      "date-parts": [
        [
          2014,
          12
        ]
      ]
    },
    "keyword": "cs.LG, stat.ML",
    "title": "New insights and perspectives on the natural gradient method",
    "type": "article-journal"
  },
  {
    "DOI": "10.22331/q-2020-05-25-269",
    "URL": "http://arxiv.org/abs/1909.02108",
    "abstract": "A quantum generalization of Natural Gradient Descent is presented as part of a general-purpose optimization framework for variational quantum circuits. The optimization dynamics is interpreted as moving in the steepest descent direction with respect to the Quantum Information Geometry, corresponding to the real part of the Quantum Geometric Tensor (QGT), also known as the Fubini-Study metric tensor. An efficient algorithm is presented for computing a block-diagonal approximation to the Fubini-Study metric tensor for parametrized quantum circuits, which may be of independent interest.",
    "author": [
      {
        "family": "Stokes",
        "given": "James"
      },
      {
        "family": "Izaac",
        "given": "Josh"
      },
      {
        "family": "Killoran",
        "given": "Nathan"
      },
      {
        "family": "Carleo",
        "given": "Giuseppe"
      }
    ],
    "container-title": "Quantum 4, 269 (2020)",
    "id": "Stokes2019",
    "issued": {
      "date-parts": [
        [
          2019,
          9
        ]
      ]
    },
    "keyword": "quant-ph, cs.LG, stat.ML",
    "title": "Quantum Natural Gradient",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevLett.126.140502",
    "URL": "http://arxiv.org/abs/1901.05374",
    "abstract": "A broad class of hybrid quantum-classical algorithms known as \"variational algorithms\" have been proposed in the context of quantum simulation, machine learning, and combinatorial optimization as a means of potentially achieving a quantum speedup on a near-term quantum device for a problem of practical interest. Such algorithms use the quantum device only to prepare parameterized quantum states and make simple measurements. A classical controller uses the measurement results to perform an optimization of a classical function induced by a quantum observable which defines the problem. While most prior works have considered optimization strategies based on estimating the objective function and doing a derivative-free or finite-difference-based optimization, some recent proposals involve directly measuring observables corresponding to the gradient of the objective function. The measurement procedure needed requires coherence time barely longer than that needed to prepare a trial state. We prove that strategies based on such gradient measurements can admit substantially faster rates of convergence to the optimum in some contexts. We first introduce a natural black-box setting for variational algorithms which we prove our results with respect to. We define a simple class of problems for which a variational algorithm based on low-depth gradient measurements and stochastic gradient descent converges to the optimum substantially faster than any possible strategy based on estimating the objective function itself, and show that stochastic gradient descent is essentially optimal for this problem. Importing known results from the stochastic optimization literature, we also derive rigorous upper bounds on the cost of variational optimization in a convex region when using gradient measurements in conjunction with certain stochastic gradient descent or stochastic mirror descent algorithms.",
    "author": [
      {
        "family": "Harrow",
        "given": "Aram"
      },
      {
        "family": "Napp",
        "given": "John"
      }
    ],
    "container-title": "Phys. Rev. Lett. 126, 140502 (2021)",
    "id": "Harrow2019",
    "issued": {
      "date-parts": [
        [
          2019,
          1
        ]
      ]
    },
    "keyword": "quant-ph, math.OC",
    "title": "Low-depth gradient measurements can improve convergence in variational hybrid quantum-classical algorithms",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1909.05074",
    "abstract": "The variational quantum eigensolver is a hybrid algorithm composed of quantum state driving and classical parameter optimization, for finding the ground state of a given Hamiltonian. The natural gradient method is an optimization method taking into account the geometric structure of the parameter space. Very recently, Stokes et al. developed the general method for employing the natural gradient for the variational quantum eigensolver. This paper gives some simple case-studies of this optimization method, to see in detail how the natural gradient optimizer makes use of the geometric property to change and improve the ordinary gradient method.",
    "author": [
      {
        "family": "Yamamoto",
        "given": "Naoki"
      }
    ],
    "id": "Yamamoto2019",
    "issued": {
      "date-parts": [
        [
          2019,
          9
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "On the natural gradient for variational quantum eigensolver",
    "type": "article-journal"
  },
  {
    "DOI": "10.1162/089976698300017746",
    "author": [
      {
        "family": "Amari",
        "given": "Shun-ichi"
      }
    ],
    "container-title": "Neural Computation",
    "id": "Amari1998",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1998,
          2
        ]
      ]
    },
    "page": "251-276",
    "publisher": "MIT Press - Journals",
    "title": "Natural Gradient Works Efficiently in Learning",
    "type": "article-journal",
    "volume": "10"
  },
  {
    "DOI": "10.1007/JHEP08(2017)105",
    "URL": "http://arxiv.org/abs/1705.05891",
    "abstract": "We consider rare semileptonic decays of a heavy $D$-meson into a light vector meson in the framework of QCD factorization. In contrast to the corresponding $B$-meson decays, the naive factorization hypothesis does not even serve as a first approximation. Rather, the decay amplitudes appear to be dominated by non-factorizable dynamics, e.g. through annihilation topologies, which are particularly sensitive to long-distance hadronic contributions. We therefore pay particular attention to intermediate vector-meson resonances appearing in quark-loop and annihilation topologies. Compared to the analogous $B$-meson decays, we identify a number of effects that result in very large theoretical uncertainties for differential decay rates. Some of these effects are found to cancel in the ratio of partially integrated decay rates for transversely and longitudinally polarized $\\rho$ mesons. On the phenomenological side this implies a very limited potential to constrain physics beyond the Standard Model by means of these decays.",
    "author": [
      {
        "family": "Feldmann",
        "given": "Thorsten"
      },
      {
        "family": "Mueller",
        "given": "Bastian"
      },
      {
        "family": "Seidel",
        "given": "Dirk"
      }
    ],
    "id": "Feldmann2017",
    "issued": {
      "date-parts": [
        [
          2017,
          5
        ]
      ]
    },
    "keyword": "hep-ph, hep-ex",
    "title": "$D \\to ρ\\,\\ell^+\\ell^-$ Decays in the QCD Factorization Approach",
    "type": "article-journal"
  },
  {
    "DOI": "10.1007/BF02551274",
    "ISSN": "1435-568X",
    "URL": "https://doi.org/10.1007/BF02551274",
    "abstract": "In this paper we demonstrate that finite linear combinations of compositions of a fixed, univariate function and a set of affine functionals can uniformly approximate any continuous function ofn real variables with support in the unit hypercube; only mild conditions are imposed on the univariate function. Our results settle an open question about representability in the class of single hidden layer neural networks. In particular, we show that arbitrary decision regions can be arbitrarily well approximated by continuous feedforward neural networks with only a single internal, hidden layer and any continuous sigmoidal nonlinearity. The paper discusses approximation properties of other possible types of nonlinearities that might be implemented by artificial neural networks.",
    "author": [
      {
        "family": "Cybenko",
        "given": "G."
      }
    ],
    "container-title": "Mathematics of Control, Signals and Systems",
    "id": "Cybenko1989",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          1989,
          12,
          1
        ]
      ]
    },
    "page": "303-314",
    "title": "Approximation by superpositions of a sigmoidal function",
    "type": "article-journal",
    "volume": "2"
  },
  {
    "DOI": "https://doi.org/10.1016/0893-6080(91)90009-T",
    "ISSN": "0893-6080",
    "URL": "https://www.sciencedirect.com/science/article/pii/089360809190009T",
    "abstract": "We show that standard multilayer feedforward networks with as few as a single hidden layer and arbitrary bounded and nonconstant activation function are universal approximators with respect to Lp(μ) performance criteria, for arbitrary finite input environment measures μ, provided only that sufficiently many hidden units are available. If the activation function is continuous, bounded and nonconstant, then continuous mappings can be learned uniformly over compact input sets. We also give very general conditions ensuring that networks with sufficiently smooth activation functions are capable of arbitrarily accurate approximation to a function and its derivatives.",
    "author": [
      {
        "family": "Hornik",
        "given": "Kurt"
      }
    ],
    "container-title": "Neural Networks",
    "id": "Hornik1991",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1991
        ]
      ]
    },
    "keyword": "Multilayer feedforward networks, Activation function, Universal approximation capabilities, Input environment measure, () approximation, Uniform approximation, Sobolev spaces, Smooth approximation",
    "page": "251-257",
    "title": "Approximation capabilities of multilayer feedforward networks",
    "type": "article-journal",
    "volume": "4"
  },
  {
    "DOI": "10.1109/ACCESS.2021.3075492",
    "author": [
      {
        "family": "Easom-Mccaldin",
        "given": "Philip"
      },
      {
        "family": "Bouridane",
        "given": "Ahmed"
      },
      {
        "family": "Belatreche",
        "given": "Ammar"
      },
      {
        "family": "Jiang",
        "given": "Richard"
      }
    ],
    "container-title": "IEEE Access",
    "id": "9415627",
    "issued": {
      "date-parts": [
        [
          2021
        ]
      ]
    },
    "page": "65127-65139",
    "title": "On Depth, Robustness and Performance Using the Data Re-Uploading Single-Qubit Classifier",
    "type": "article-journal",
    "volume": "9"
  },
  {
    "DOI": "10.1007/JHEP03(2022)066",
    "URL": "http://arxiv.org/abs/2110.06948",
    "abstract": "Anomaly detection relies on designing a score to determine whether a particular event is uncharacteristic of a given background distribution. One way to define a score is to use autoencoders, which rely on the ability to reconstruct certain types of data (background) but not others (signals). In this paper, we study some challenges associated with variational autoencoders, such as the dependence on hyperparameters and the metric used, in the context of anomalous signal (top and $W$) jets in a QCD background. We find that the hyperparameter choices strongly affect the network performance and that the optimal parameters for one signal are non-optimal for another. In exploring the networks, we uncover a connection between the latent space of a variational autoencoder trained using mean-squared-error and the optimal transport distances within the dataset. We then show that optimal transport distances to representative events in the background dataset can be used directly for anomaly detection, with performance comparable to the autoencoders. Whether using autoencoders or optimal transport distances for anomaly detection, we find that the choices that best represent the background are not necessarily best for signal identification. These challenges with unsupervised anomaly detection bolster the case for additional exploration of semi-supervised or alternative approaches.",
    "author": [
      {
        "family": "Fraser",
        "given": "Katherine"
      },
      {
        "family": "Homiller",
        "given": "Samuel"
      },
      {
        "family": "Mishra",
        "given": "Rashmish K."
      },
      {
        "family": "Ostdiek",
        "given": "Bryan"
      },
      {
        "family": "Schwartz",
        "given": "Matthew D."
      }
    ],
    "id": "Fraser2021",
    "issued": {
      "date-parts": [
        [
          2021,
          10
        ]
      ]
    },
    "keyword": "hep-ph, cs.LG, hep-ex, physics.data-an",
    "title": "Challenges for Unsupervised Anomaly Detection in Particle Physics",
    "type": "article-journal"
  },
  {
    "DOI": "10.1007/JHEP06(2021)161",
    "URL": "http://arxiv.org/abs/2104.09051",
    "abstract": "Autoencoders are widely used in machine learning applications, in particular for anomaly detection. Hence, they have been introduced in high energy physics as a promising tool for model-independent new physics searches. We scrutinize the usage of autoencoders for unsupervised anomaly detection based on reconstruction loss to show their capabilities, but also their limitations. As a particle physics benchmark scenario, we study the tagging of top jet images in a background of QCD jet images. Although we reproduce the positive results from the literature, we show that the standard autoencoder setup cannot be considered as a model-independent anomaly tagger by inverting the task: due to the sparsity and the specific structure of the jet images, the autoencoder fails to tag QCD jets if it is trained on top jets even in a semi-supervised setup. Since the same autoencoder architecture can be a good tagger for a specific example of an anomaly and a bad tagger for a different example, we suggest improved performance measures for the task of model-independent anomaly detection. We also improve the capability of the autoencoder to learn non-trivial features of the jet images, such that it is able to achieve both top jet tagging and the inverse task of QCD jet tagging with the same setup. However, we want to stress that a truly model-independent and powerful autoencoder-based unsupervised jet tagger still needs to be developed.",
    "author": [
      {
        "family": "Finke",
        "given": "Thorben"
      },
      {
        "family": "Krämer",
        "given": "Michael"
      },
      {
        "family": "Morandini",
        "given": "Alessandro"
      },
      {
        "family": "Mück",
        "given": "Alexander"
      },
      {
        "family": "Oleksiyuk",
        "given": "Ivan"
      }
    ],
    "container-title": "JHEP 06 (2021) 161",
    "id": "Finke2021",
    "issued": {
      "date-parts": [
        [
          2021,
          4
        ]
      ]
    },
    "keyword": "hep-ph, cs.LG, physics.data-an",
    "title": "Autoencoders for unsupervised anomaly detection in high energy physics",
    "type": "article-journal"
  },
  {
    "DOI": "10.1016/j.nima.2020.164304",
    "URL": "http://arxiv.org/abs/1902.08276",
    "abstract": "We describe the construction of end-to-end jet image classifiers based on simulated low-level detector data to discriminate quark- vs. gluon-initiated jets with high-fidelity simulated CMS Open Data. We highlight the importance of precise spatial information and demonstrate competitive performance to existing state-of-the-art jet classifiers. We further generalize the end-to-end approach to event-level classification of quark vs. gluon di-jet QCD events. We compare the fully end-to-end approach to using hand-engineered features and demonstrate that the end-to-end algorithm is robust against the effects of underlying event and pile-up.",
    "author": [
      {
        "family": "Andrews",
        "given": "Michael"
      },
      {
        "family": "Alison",
        "given": "John"
      },
      {
        "family": "An",
        "given": "Sitong"
      },
      {
        "family": "Bryant",
        "given": "Patrick"
      },
      {
        "family": "Burkle",
        "given": "Bjorn"
      },
      {
        "family": "Gleyzer",
        "given": "Sergei"
      },
      {
        "family": "Narain",
        "given": "Meenakshi"
      },
      {
        "family": "Paulini",
        "given": "Manfred"
      },
      {
        "family": "Poczos",
        "given": "Barnabas"
      },
      {
        "family": "Usai",
        "given": "Emanuele"
      }
    ],
    "container-title": "Nucl. Instrum. Methods Phys. Res. A 977, 164304 (2020)",
    "id": "Andrews2019",
    "issued": {
      "date-parts": [
        [
          2019,
          2
        ]
      ]
    },
    "keyword": "hep-ex, cs.CV, cs.LG, physics.data-an",
    "title": "End-to-End Jet Classification of Quarks and Gluons with the CMS Open Data",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevLett.123.041801",
    "URL": "http://arxiv.org/abs/1902.02346",
    "abstract": "When are two collider events similar? Despite the simplicity and generality of this question, there is no established notion of the distance between two events. To address this question, we develop a metric for the space of collider events based on the earth mover’s distance: the \"work\" required to rearrange the radiation pattern of one event into another. We expose interesting connections between this metric and the structure of infrared- and collinear-safe observables, providing a novel technique to quantify event modifications due to hadronization, pileup, and detector effects. We showcase how this metrization unlocks powerful new tools for analyzing and visualizing collider data without relying upon a choice of observables. More broadly, this framework paves the way for data-driven collider phenomenology without specialized observables or machine learning models.",
    "author": [
      {
        "family": "Komiske",
        "given": "Patrick T."
      },
      {
        "family": "Metodiev",
        "given": "Eric M."
      },
      {
        "family": "Thaler",
        "given": "Jesse"
      }
    ],
    "container-title": "Phys. Rev. Lett. 123, 041801 (2019)",
    "id": "Komiske2019",
    "issued": {
      "date-parts": [
        [
          2019,
          2
        ]
      ]
    },
    "keyword": "hep-ph, hep-ex",
    "title": "The Metric Space of Collider Events",
    "type": "article-journal"
  },
  {
    "DOI": "10.1109/CSCI54926.2021.00085",
    "author": [
      {
        "family": "Rivas",
        "given": "Pablo"
      },
      {
        "family": "Zhao",
        "given": "Liang"
      },
      {
        "family": "Orduz",
        "given": "Javier"
      }
    ],
    "container-title": "2021 International Conference on Computational Science and Computational Intelligence (CSCI)",
    "id": "9799154",
    "issued": {
      "date-parts": [
        [
          2021
        ]
      ]
    },
    "page": "52-57",
    "title": "Hybrid Quantum Variational Autoencoders for Representation Learning",
    "type": "paper-conference"
  },
  {
    "URL": "http://arxiv.org/abs/2205.05625",
    "abstract": "An emerging direction of quantum computing is to establish meaningful quantum applications in various fields of artificial intelligence, including natural language processing (NLP). Although some efforts based on syntactic analysis have opened the door to research in Quantum NLP (QNLP), limitations such as heavy syntactic preprocessing and syntax-dependent network architecture make them impracticable on larger and real-world data sets. In this paper, we propose a new simple network architecture, called the quantum self-attention neural network (QSANN), which can make up for these limitations. Specifically, we introduce the self-attention mechanism into quantum neural networks and then utilize a Gaussian projected quantum self-attention serving as a sensible quantum version of self-attention. As a result, QSANN is effective and scalable on larger data sets and has the desirable property of being implementable on near-term quantum devices. In particular, our QSANN outperforms the best existing QNLP model based on syntactic analysis as well as a simple classical self-attention neural network in numerical experiments of text classification tasks on public data sets. We further show that our method exhibits robustness to low-level quantum noises.",
    "author": [
      {
        "family": "Li",
        "given": "Guangxi"
      },
      {
        "family": "Zhao",
        "given": "Xuanqiang"
      },
      {
        "family": "Wang",
        "given": "Xin"
      }
    ],
    "id": "Li2022",
    "issued": {
      "date-parts": [
        [
          2022,
          5
        ]
      ]
    },
    "keyword": "quant-ph, cs.AI, cs.LG",
    "title": "Quantum Self-Attention Neural Networks for Text Classification",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/2009.02823",
    "abstract": "Calculating the energy gradient in parameter space has become an almost ubiquitous subroutine of variational near-term quantum algorithms. \"Faithful\" classical emulation of this subroutine mimics its quantum evaluation, and scales as O(P\\^2) gate operations for P variational parameters. This is often the bottleneck for the moderately-sized simulations, and has attracted HPC strategies like \"batch-circuit\" evaluation. We here present a novel derivation of an emulation strategy to precisely calculate the gradient in O(P) time and using O(1) state-vectors, compatible with \"full-state\" state-vector simulators. The prescribed algorithm resembles the optimised technique for automatic differentiation of reversible cost functions, often used in classical machine learning, and first employed in quantum simulators like Yao.jl. In contrast, our scheme derives directly from a recurrent form of quantum operators, and may be more familiar to a quantum computing community. Our strategy is very simple, uses only ’apply gate’, ’clone state’ and ’inner product’ primitives and is hence straightforward to implement and integrate with existing simulators. It is compatible with gate parallelisation schemes, and hardware accelerated and distributed simulators. We describe the scheme in an instructive way, including details of how common gate derivatives can be performed, to clearly guide implementation in existing quantum simulators. We furthermore demonstrate the scheme by implementing it in Qiskit, and perform some comparative benchmarking with faithful simulation. Finally, we remark upon the difficulty of extending the scheme to density-matrix simulation of noisy channels.",
    "author": [
      {
        "family": "Jones",
        "given": "Tyson"
      },
      {
        "family": "Gacon",
        "given": "Julien"
      }
    ],
    "id": "Jones2020",
    "issued": {
      "date-parts": [
        [
          2020,
          9
        ]
      ]
    },
    "keyword": "quant-ph, physics.comp-ph",
    "title": "Efficient calculation of gradients in classical simulations of variational quantum algorithms",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1406.2661",
    "abstract": "We propose a new framework for estimating generative models via an adversarial process, in which we simultaneously train two models: a generative model G that captures the data distribution, and a discriminative model D that estimates the probability that a sample came from the training data rather than G. The training procedure for G is to maximize the probability of D making a mistake. This framework corresponds to a minimax two-player game. In the space of arbitrary functions G and D, a unique solution exists, with G recovering the training data distribution and D equal to 1/2 everywhere. In the case where G and D are defined by multilayer perceptrons, the entire system can be trained with backpropagation. There is no need for any Markov chains or unrolled approximate inference networks during either training or generation of samples. Experiments demonstrate the potential of the framework through qualitative and quantitative evaluation of the generated samples.",
    "author": [
      {
        "family": "Goodfellow",
        "given": "Ian J."
      },
      {
        "family": "Pouget-Abadie",
        "given": "Jean"
      },
      {
        "family": "Mirza",
        "given": "Mehdi"
      },
      {
        "family": "Xu",
        "given": "Bing"
      },
      {
        "family": "Warde-Farley",
        "given": "David"
      },
      {
        "family": "Ozair",
        "given": "Sherjil"
      },
      {
        "family": "Courville",
        "given": "Aaron"
      },
      {
        "family": "Bengio",
        "given": "Yoshua"
      }
    ],
    "id": "Goodfellow2014",
    "issued": {
      "date-parts": [
        [
          2014,
          6
        ]
      ]
    },
    "keyword": "stat.ML, cs.LG",
    "title": "Generative Adversarial Networks",
    "type": "article-journal"
  },
  {
    "DOI": "10.21468/SciPostPhys.7.6.075",
    "URL": "http://arxiv.org/abs/1907.03764",
    "abstract": "Event generation for the LHC can be supplemented by generative adversarial networks, which generate physical events and avoid highly inefficient event unweighting. For top pair production we show how such a network describes intermediate on-shell particles, phase space boundaries, and tails of distributions. In particular, we introduce the maximum mean discrepancy to resolve sharp local features. It can be extended in a straightforward manner to include for instance off-shell contributions, higher orders, or approximate detector effects.",
    "author": [
      {
        "family": "Butter",
        "given": "Anja"
      },
      {
        "family": "Plehn",
        "given": "Tilman"
      },
      {
        "family": "Winterhalder",
        "given": "Ramon"
      }
    ],
    "container-title": "SciPost Phys. 7, 075 (2019)",
    "id": "Butter2019",
    "issued": {
      "date-parts": [
        [
          2019,
          7
        ]
      ]
    },
    "keyword": "hep-ph",
    "title": "How to GAN LHC Events",
    "type": "article-journal"
  },
  {
    "DOI": "10.1007/s41781-017-0004-6",
    "URL": "http://arxiv.org/abs/1701.05927",
    "abstract": "We provide a bridge between generative modeling in the Machine Learning community and simulated physical processes in High Energy Particle Physics by applying a novel Generative Adversarial Network (GAN) architecture to the production of jet images – 2D representations of energy depositions from particles interacting with a calorimeter. We propose a simple architecture, the Location-Aware Generative Adversarial Network, that learns to produce realistic radiation patterns from simulated high energy particle collisions. The pixel intensities of GAN-generated images faithfully span over many orders of magnitude and exhibit the desired low-dimensional physical properties (i.e., jet mass, n-subjettiness, etc.). We shed light on limitations, and provide a novel empirical validation of image quality and validity of GAN-produced simulations of the natural world. This work provides a base for further explorations of GANs for use in faster simulation in High Energy Particle Physics.",
    "author": [
      {
        "dropping-particle": "de",
        "family": "Oliveira",
        "given": "Luke"
      },
      {
        "family": "Paganini",
        "given": "Michela"
      },
      {
        "family": "Nachman",
        "given": "Benjamin"
      }
    ],
    "container-title": "Comput Softw Big Sci (2017) 1: 4",
    "id": "Oliveira2017",
    "issued": {
      "date-parts": [
        [
          2017,
          1
        ]
      ]
    },
    "keyword": "stat.ML, hep-ex, physics.data-an",
    "title": "Learning Particle Physics by Example: Location-Aware Generative Adversarial Networks for Physics Synthesis",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/2104.01725",
    "abstract": "Accurate and fast simulation of particle physics processes is crucial for the high-energy physics community. Simulating particle interactions with detectors is both time consuming and computationally expensive. With the proton-proton collision energy of 13 TeV, the Large Hadron Collider is uniquely positioned to detect and measure the rare phenomena that can shape our knowledge of new interactions. The High-Luminosity Large Hadron Collider (HL-LHC) upgrade will put a significant strain on the computing infrastructure due to increased event rate and levels of pile-up. Simulation of high-energy physics collisions needs to be significantly faster without sacrificing the physics accuracy. Machine learning approaches can offer faster solutions, while maintaining a high level of fidelity. We discuss a graph generative model that provides effective reconstruction of LHC events, paving the way for full detector level fast simulation for HL-LHC.",
    "author": [
      {
        "family": "Hariri",
        "given": "Ali"
      },
      {
        "family": "Dyachkova",
        "given": "Darya"
      },
      {
        "family": "Gleyzer",
        "given": "Sergei"
      }
    ],
    "id": "Hariri2021",
    "issued": {
      "date-parts": [
        [
          2021,
          4
        ]
      ]
    },
    "keyword": "hep-ex, cs.LG",
    "title": "Graph Generative Models for Fast Detector Simulations in High Energy Physics",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevLett.121.040502",
    "URL": "http://arxiv.org/abs/1804.09139",
    "abstract": "Generative adversarial networks (GANs) represent a powerful tool for classical machine learning: a generator tries to create statistics for data that mimics those of a true data set, while a discriminator tries to discriminate between the true and fake data. The learning process for generator and discriminator can be thought of as an adversarial game, and under reasonable assumptions, the game converges to the point where the generator generates the same statistics as the true data and the discriminator is unable to discriminate between the true and the generated data. This paper introduces the notion of quantum generative adversarial networks (QuGANs), where the data consists either of quantum states, or of classical data, and the generator and discriminator are equipped with quantum information processors. We show that the unique fixed point of the quantum adversarial game also occurs when the generator produces the same statistics as the data. Since quantum systems are intrinsically probabilistic the proof of the quantum case is different from - and simpler than - the classical case. We show that when the data consists of samples of measurements made on high-dimensional spaces, quantum adversarial networks may exhibit an exponential advantage over classical adversarial networks.",
    "author": [
      {
        "family": "Lloyd",
        "given": "Seth"
      },
      {
        "family": "Weedbrook",
        "given": "Christian"
      }
    ],
    "container-title": "Phys. Rev. Lett. 121, 040502 (2018)",
    "id": "Lloyd2018",
    "issued": {
      "date-parts": [
        [
          2018,
          4
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Quantum generative adversarial learning",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevA.98.012324",
    "URL": "http://arxiv.org/abs/1804.08641",
    "abstract": "Quantum machine learning is expected to be one of the first potential general-purpose applications of near-term quantum devices. A major recent breakthrough in classical machine learning is the notion of generative adversarial training, where the gradients of a discriminator model are used to train a separate generative model. In this work and a companion paper, we extend adversarial training to the quantum domain and show how to construct generative adversarial networks using quantum circuits. Furthermore, we also show how to compute gradients – a key element in generative adversarial network training – using another quantum circuit. We give an example of a simple practical circuit ansatz to parametrize quantum machine learning models and perform a simple numerical experiment to demonstrate that quantum generative adversarial networks can be trained successfully.",
    "author": [
      {
        "family": "Dallaire-Demers",
        "given": "Pierre-Luc"
      },
      {
        "family": "Killoran",
        "given": "Nathan"
      }
    ],
    "container-title": "Phys. Rev. A 98, 012324 (2018)",
    "id": "DallaireDemers2018",
    "issued": {
      "date-parts": [
        [
          2018,
          4
        ]
      ]
    },
    "keyword": "quant-ph, cs.LG",
    "title": "Quantum generative adversarial networks",
    "type": "article-journal"
  },
  {
    "DOI": "10.1103/PhysRevLett.100.160501",
    "URL": "http://arxiv.org/abs/0708.1879",
    "abstract": "A random access memory (RAM) uses n bits to randomly address N=2\\^n distinct memory cells. A quantum random access memory (qRAM) uses n qubits to address any quantum superposition of N memory cells. We present an architecture that exponentially reduces the requirements for a memory call: O(log N) switches need be thrown instead of the N used in conventional (classical or quantum) RAM designs. This yields a more robust qRAM algorithm, as it in general requires entanglement among exponentially less gates, and leads to an exponential decrease in the power needed for addressing. A quantum optical implementation is presented.",
    "author": [
      {
        "family": "Giovannetti",
        "given": "Vittorio"
      },
      {
        "family": "Lloyd",
        "given": "Seth"
      },
      {
        "family": "Maccone",
        "given": "Lorenzo"
      }
    ],
    "container-title": "V. Giovannetti, S. Lloyd, L. Maccone, Phys. Rev. Lett. 100, 160501 (2008).",
    "id": "Giovannetti2007",
    "issued": {
      "date-parts": [
        [
          2007,
          8
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Quantum random access memory",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/1901.00848",
    "abstract": "We propose a hybrid quantum-classical approach to model continuous classical probability distributions using a variational quantum circuit. The architecture of the variational circuit consists of two parts: a quantum circuit employed to encode a classical random variable into a quantum state, called the quantum encoder, and a variational circuit whose parameters are optimized to mimic a target probability distribution. Samples are generated by measuring the expectation values of a set of operators chosen at the beginning of the calculation. Our quantum generator can be complemented with a classical function, such as a neural network, as part of the classical post-processing. We demonstrate the application of the quantum variational generator using a generative adversarial learning approach, where the quantum generator is trained via its interaction with a discriminator model that compares the generated samples with those coming from the real data distribution. We show that our quantum generator is able to learn target probability distributions using either a classical neural network or a variational quantum circuit as the discriminator. Our implementation takes advantage of automatic differentiation tools to perform the optimization of the variational circuits employed. The framework presented here for the design and implementation of variational quantum generators can serve as a blueprint for designing hybrid quantum-classical architectures for other machine learning tasks on near-term quantum devices.",
    "author": [
      {
        "family": "Romero",
        "given": "Jonathan"
      },
      {
        "family": "Aspuru-Guzik",
        "given": "Alan"
      }
    ],
    "id": "Romero2019",
    "issued": {
      "date-parts": [
        [
          2019,
          1
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Variational quantum generators: Generative adversarial quantum machine learning for continuous distributions",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/2206.03066",
    "abstract": "Quantum computers are next-generation devices that hold promise to perform calculations beyond the reach of classical computers. A leading method towards achieving this goal is through quantum machine learning, especially quantum generative learning. Due to the intrinsic probabilistic nature of quantum mechanics, it is reasonable to postulate that quantum generative learning models (QGLMs) may surpass their classical counterparts. As such, QGLMs are receiving growing attention from the quantum physics and computer science communities, where various QGLMs that can be efficiently implemented on near-term quantum machines with potential computational advantages are proposed. In this paper, we review the current progress of QGLMs from the perspective of machine learning. Particularly, we interpret these QGLMs, covering quantum circuit born machines, quantum generative adversarial networks, quantum Boltzmann machines, and quantum autoencoders, as the quantum extension of classical generative learning models. In this context, we explore their intrinsic relation and their fundamental differences. We further summarize the potential applications of QGLMs in both conventional machine learning tasks and quantum physics. Last, we discuss the challenges and further research directions for QGLMs.",
    "author": [
      {
        "family": "Tian",
        "given": "Jinkai"
      },
      {
        "family": "Sun",
        "given": "Xiaoyu"
      },
      {
        "family": "Du",
        "given": "Yuxuan"
      },
      {
        "family": "Zhao",
        "given": "Shanshan"
      },
      {
        "family": "Liu",
        "given": "Qing"
      },
      {
        "family": "Zhang",
        "given": "Kaining"
      },
      {
        "family": "Yi",
        "given": "Wei"
      },
      {
        "family": "Huang",
        "given": "Wanrong"
      },
      {
        "family": "Wang",
        "given": "Chaoyue"
      },
      {
        "family": "Wu",
        "given": "Xingyao"
      },
      {
        "family": "Hsieh",
        "given": "Min-Hsiu"
      },
      {
        "family": "Liu",
        "given": "Tongliang"
      },
      {
        "family": "Yang",
        "given": "Wenjing"
      },
      {
        "family": "Tao",
        "given": "Dacheng"
      }
    ],
    "id": "Tian2022",
    "issued": {
      "date-parts": [
        [
          2022,
          6
        ]
      ]
    },
    "keyword": "quant-ph, cs.CV, cs.LG",
    "title": "Recent Advances for Quantum Neural Networks in Generative Learning",
    "type": "article-journal"
  },
  {
    "URL": "http://arxiv.org/abs/2105.00080",
    "abstract": "Generative adversarial networks (GANs) are one of the most widely adopted semisupervised and unsupervised machine learning methods for high-definition image, video, and audio generation. In this work, we propose a new type of architecture for quantum generative adversarial networks (entangling quantum GAN, EQ-GAN) that overcomes some limitations of previously proposed quantum GANs. Leveraging the entangling power of quantum circuits, EQ-GAN guarantees the convergence to a Nash equilibrium under minimax optimization of the discriminator and generator circuits by performing entangling operations between both the generator output and true quantum data. We show that EQ-GAN has additional robustness against coherent errors and demonstrate the effectiveness of EQ-GAN experimentally in a Google Sycamore superconducting quantum processor. By adversarially learning efficient representations of quantum states, we prepare an approximate quantum random access memory (QRAM) and demonstrate its use in applications including the training of quantum neural networks.",
    "author": [
      {
        "family": "Niu",
        "given": "Murphy Yuezhen"
      },
      {
        "family": "Zlokapa",
        "given": "Alexander"
      },
      {
        "family": "Broughton",
        "given": "Michael"
      },
      {
        "family": "Boixo",
        "given": "Sergio"
      },
      {
        "family": "Mohseni",
        "given": "Masoud"
      },
      {
        "family": "Smelyanskyi",
        "given": "Vadim"
      },
      {
        "family": "Neven",
        "given": "Hartmut"
      }
    ],
    "id": "Niu2021",
    "issued": {
      "date-parts": [
        [
          2021,
          4
        ]
      ]
    },
    "keyword": "quant-ph",
    "title": "Entangling Quantum Generative Adversarial Networks",
    "type": "article-journal"
  }
]
